In [83]:
import pandas as pd

In [84]:
rentas= pd.read_csv('rentas.csv')
rentas_2= pd.read_csv('rentas_2.csv')

#Concatenamos los datos:

In [85]:
df = pd.concat([rentas, rentas_2], axis=0)

#Rainiciamos el indez de nuestra columna: #No unir descripcion.
df.reset_index(drop = True, inplace = True)

### #Emepzamos a limpiar los datos:

In [86]:
df.head(1)

,info,m2_a_l_estac,descripcion,direccion
0,"MN 92,000\nFraccionamiento Costa Azul, Acapulc...",460 m²\n460 m²\n20 estac.,"Edificio en renta, 4 niveles disponibles. Fren...","En Renta Edificio, Pisos Completos Frente a Wa..."

### #Empezamos hacer la limpieza de datos(Data cleaning)

In [87]:
#Empezamos la limpieza de la columna " m2_a_l_estac ":
m2_df = df['m2_a_l_estac'].str.split("\n", expand=True)
m2_df.head(1)

        0       1          2     3
0  460 m²  460 m²  20 estac.  None

In [88]:
#Empezamos la limpieza de info:
df_t = df['info'].str.split("\n", n=1,expand=True)
df_t.head(1)

           0                                               1
0  MN 92,000  Fraccionamiento Costa Azul, Acapulco de Juárez

In [89]:
#Empezamos a modificar los datos de precio:
precio = df_t[0].str.split('MN',n=1,  expand=True)
precio_1 = precio[0].iloc[11:].str.split('$', n=1, expand=True)
precio_1 = precio_1[1].str.split('MXN', n=1, expand=True)
precio_1 = precio_1.drop(columns = [1])

#Ahora vamos a guardar las filas de 0 a 10 con iloc
precio_2 = precio[1].iloc[0:11]

In [90]:
#concatenamos las dos columnas:
precio = pd.concat([precio_2, precio_1]) 
precio

           0
0     92,000
1      3,200
2     54,437
3     54,466
4      3,200
5     54,437
6     25,000
7     82,816
8      3,000
9     82,816
10     7,500
11   25,000
12   16,550
13   25,000
14   13,000
15   49,500
16   14,000
17    7,200
18   54,437
19   54,466
20  103,500
21   54,466
22   43,000
23  250,000
24   10,208
25   10,000
26    7,000
27  120,000
28    5,000
29   11,500
30   13,000
31   58,400
32    7,500
33    8,500
34   15,000

In [93]:
#Empezamos transformando las comas por el punto:
precio = precio[0].str.replace(",", ".").astype(float)

In [ ]:
#Despues de eso, empezamos hacer la formula para poder sacar el m2 de un cada inmueble:

In [ ]:
#Variable que contiene los metros cuadrados:
m2_df 

#Variable que contieen precio:
precio